art-share-api-main/Art_share_project/app/controllers/comments_controller.rb

  def index
    case
    when params[:author_id]
      comments = Comment.where(author_id: params[:author_id])
    when params[:artwork_id]
      comments = Comment.where(artwork_id: params[:artwork_id])
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments"