art-share-api-main/Art_share_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:query]
      users = User.where("username LIKE ?", "%#{params[:query]}%")
    else
      users = User.all